Autodesk.Revit.DB.ColorFillScheme.CanDefineByRange
Checks whether the scheme entries can be explained by range.
Returns:
Returns true ifthe scheme entries can be explained by range, false otherwise.
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.IsValidParameterDefinitionId(Autodesk.Revit.DB.ElementId)
Checks whether the input parameter id can be applied to the scheme.
Returns:
Returns true if the input parameter id can be set to this scheme, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.IsValidSchemeName(System.String)
Checks whether the name is valid for new generated scheme.
Remarks:
The name should not be empty, or all spaces, or include prohibited characters or duplicated with existing schemes.
Returns:
Returns true if the name is valid for new generated scheme, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.CanUpdateEntry(Autodesk.Revit.DB.ColorFillSchemeEntry)
Checks whether entry exists in the scheme and not the same as input one.
entry:
The entry to be updated.
Returns:
Returns true if entry exist in scheme and not the same as input one, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.CanRemoveEntry(Autodesk.Revit.DB.ColorFillSchemeEntry)
Checks whether entry can be removed from the scheme.
Remarks:
An entry cannot be removed if it is in use or does not exist in the scheme.
entry:
The entry to remove.
Returns:
Returns true if entry can be removed from the scheme, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.Duplicate(System.String)
Generates a copy of current scheme.
name:
The desired name of copied scheme.
Returns:
The id of copied scheme.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name is not valid for new generated scheme.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.RemoveEntry(Autodesk.Revit.DB.ColorFillSchemeEntry)
Removes an entry whose parameter value is the same as the input from the scheme
Remarks:
The entry can not be removed if it is in use.
entry:
The entry to remove.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The entry cannot be removed from the scheme.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.SortEntries
Sorts the scheme entries ascending.
Remarks:
If the scheme parameter value storage type is ElementId, then
the order of entries would be based on the name of the elements.
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.AreEntriesConsistentWithScheme(System.Collections.Generic.IList{Autodesk.Revit.DB.ColorFillSchemeEntry})
Checks whether the entries can be set to the scheme or not.
entries:
The entries to check.
Returns:
The state of the entries and scheme consistency.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.IsEntryConsistentWithScheme(Autodesk.Revit.DB.ColorFillSchemeEntry)
Checks whether an entry can be added to the scheme or not.
entry:
The entry to check.
Returns:
The state of entry and scheme consistency.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.AddEntry(Autodesk.Revit.DB.ColorFillSchemeEntry)
Adds new entry to the scheme.
Remarks:
To make sure that entry can be added to the scheme, call Autodesk.Revit.DB.ColorFillScheme.IsEntryConsistentWithScheme(Autodesk.Revit.DB.ColorFillSchemeEntry) first.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There already exists an entry with the same value in the scheme.
-or-
The entry value is out of range.
-or-
The scheme and the entry have different parameter storage type.
-or-
The fill pattern id is not valid for scheme.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.GetSupportedParameterIds
Retrieves collection of all parameters supported by the scheme.
Remarks:
Supported parameters depends on Autodesk.Revit.DB.ColorFillScheme.CategoryId property.
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.SetFormatOptions(Autodesk.Revit.DB.FormatOptions)
Sets the FormatOptions of the scheme.
Remarks:
This method will set the FormatOptions if the scheme is by range, otherwise do nothing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.GetFormatOptions
Returns the FormatOptions of the scheme.
Remarks:
This method will return the default FormatOptions if the scheme is by value.
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.SetEntries(System.Collections.Generic.IList{Autodesk.Revit.DB.ColorFillSchemeEntry})
Update scheme entries in batch mode.
Remarks:
For by range scheme:
If there is only one entry in the input, Revit will generate another one automatically.
If the first existing entry is found in the input, it will be updated, otherwise keep not changed.
If the other existing entries are found in the input, they will be updated, otherwise removed.
For by value scheme:
For an existing entry that is in use, it will be updated if it can be found in the input, otherwise keep not changed.
For an existing entry that is no in use, it will be updated if it can be found in the input, otherwise removed.
If an entry in the input cannot be found in the existing entries, it will be added to the scheme.
To make sure that entry can be added to the scheme, call Autodesk.Revit.DB.ColorFillScheme.AreEntriesConsistentWithScheme(System.Collections.Generic.IList`1{Autodesk.Revit.DB.ColorFillSchemeEntry}) first.
entries:
Collection of new entries.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There exists entries whose values are duplicated in the input entries.
-or-
There exists at lease one entry whose value is invalid for the scheme in the input entries.
-or-
There exists at least one entry in the input entries whose storage type is different with the scheme.
-or-
There exists at least one entry in the input entries whose fill pattern is invalid for color fill scheme.
-or-
There exists some inconsistent in the input entries.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.UpdateEntry(Autodesk.Revit.DB.ColorFillSchemeEntry)
Updates the scheme entry with the same parameter value as the input entry.
Remarks:
The following entry fields can be updated:
Color
FillPattenId
Caption
IsVisible
/
entry:
The entry to be updated.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The entry does not exist or the same as input one.
-or-
The entry does not exist or all the updating fields are the same as existing one.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.GetEntries
Retrieves copies of all entries.
Remarks:
This method recalculates entries based on the current parameter values of the elements colored by the scheme.
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.ParameterDefinition
Represents the parameter of the elements that this scheme could be used to color.
Remarks:
When this property changed, all existing scheme entries will be removed from the scheme,
and the value of Autodesk.Revit.DB.ColorFillScheme.IsByRange property will be set to false if the parameter
storage type is not numeric.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The paramId cannot be applied to the scheme.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.AreaSchemeId
Represents the id of AreaScheme of area plan views that this scheme could be applied to.
Remarks:
Only meaningful if the Autodesk.Revit.DB.ColorFillScheme.CategoryId is OST_Areas.
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.IsLinkedFilesIncluded
Represent if the scheme includes entries whose parameter values are based on elements from linked files.
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.IsByRange
Represents if the parameter values in entries are treated as value range or not.
Remarks:
Notes:
Only numeric parameter values could be treated as by range.
There will exist at least two entries if the scheme is by range,
and the first entry value should be always Int.MinValue or -Double.MaxValue.
The entries will always be sorted by ascending in the scheme if it is by range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The scheme entries cannot be explained by range.
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.StorageType
Represents the type of parameter values stored in entries.
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.CategoryId
Represents the element category that can be colored by this scheme.
Since:
2022

Autodesk.Revit.DB.ColorFillScheme.Title
Represents the title displayed in Autodesk.Revit.DB.ColorFillLegend.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillScheme
Represents a color scheme could be used to colorfy elements in floor plan views and section views.
Remarks:
A color scheme is based on element category and one of the category parameter, it contains a
set of Autodesk.Revit.DB.ColorFillSchemeEntry which stores parameter value,
color, fill pattern and other entry data. The entry paramater values may be a range or a single value,
based on the Autodesk.Revit.DB.ColorFillScheme.IsByRange property. Then elements with the specified category
could be colored with the color and fill pattern of matching entry whose parameter value or value range
matches the element parameter value.
You can retrieve the entries with Autodesk.Revit.DB.ColorFillScheme.GetEntries, or modify entries with
Autodesk.Revit.DB.ColorFillScheme.AddEntry(Autodesk.Revit.DB.ColorFillSchemeEntry), Autodesk.Revit.DB.ColorFillScheme.RemoveEntry(Autodesk.Revit.DB.ColorFillSchemeEntry), Autodesk.Revit.DB.ColorFillScheme.UpdateEntry(Autodesk.Revit.DB.ColorFillSchemeEntry)  and Autodesk.Revit.DB.ColorFillScheme.SetEntries(System.Collections.Generic.IList`1{Autodesk.Revit.DB.ColorFillSchemeEntry}).
Unlike most of the other elements, the color scheme works in an "asynchronous" way in UI:
If document elements change, the color scheme will not be updated immediately.
If color schemes changes, the document elements will not be updated immediately too.
API works slightly different with UI:
Autodesk.Revit.DB.ColorFillScheme.GetEntries will return the entries corresponding to the latest document elements status immediately.
The entries modification operation will retrieve the latest entries with Autodesk.Revit.DB.ColorFillScheme.GetEntries at first, and then modify
those entries by request, but document elements will still not be updated immediately.
To modify multiple entries, it's better to use Autodesk.Revit.DB.ColorFillScheme.SetEntries(System.Collections.Generic.IList`1{Autodesk.Revit.DB.ColorFillSchemeEntry}) but not modify them one by one with other methods
for better performance.
Notes:
To apply a color scheme whose Autodesk.Revit.DB.ColorFillScheme.CategoryId property is OST_Areas to an area plan view,
the Autodesk.Revit.DB.ColorFillScheme.AreaSchemeId property must be the same as the view if it is not used as a template.
To generate a new color scheme, you have to use Autodesk.Revit.DB.ColorFillScheme.Duplicate(System.String) method to duplicate form an existing one.
There should not exist two entries values that are the same in a color scheme. if the Autodesk.Revit.DB.ColorFillScheme.StorageType property is Double,
then the value accuracy should be based on Autodesk.Revit.DB.FormatOptions property.
Since:
2022